spec/spec/SVAP/AcquiringApplications/Examples/app_flow.example.2006.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:int="http://bpc.ru/sv/SVAP">
<soapenv:Header/>
<soapenv:Body>
<application xmlns="http://sv.bpc.in/SVAP">
    <application_type>APTPACQA</application_type>                                       <!-- Application type - Acquiring -->
    <application_flow_id>2006</application_flow_id>                                     <!-- Application flow (business process) - Close additional service -->
    <application_status>APST0006</application_status>                                   <!-- Application status - Ready to process -->
    <operator_id>ADMIN</operator_id>                                                	<!-- User name who made this application -->
    <institution_id>1001</institution_id>                                               <!-- Institution identifier -->
    <agent_id>10000001</agent_id>                                                       <!-- Agent identifier -->
    <customer>
        <command>CMMDEXPR</command>                                                     <!-- Command for customer - find existing customer -->
        <customer_number>0000000000000000000697</customer_number>                       <!-- Unique customer number -->
        <contract>
            <command>CMMDEXPR</command>                                                 <!-- Command for contract - find existing contract -->
            <contract_number>00000000000000000000000000000736</contract_number>			<!-- Contract number -->
            <merchant id="merchant_1">
				<command>CMMDEXPR</command>                                             <!-- Find existing parent merchant -->
				<merchant_number>000000070000063</merchant_number>           			<!-- Merchant number -->
			</merchant>
            <service value="70000072">                                                  <!-- Service - attribute value contain service identifier which opened for merchant -->
                <service_object ref_id="merchant_1">                                    <!-- Service reference - attribute ref_id contain reference on attached object - merchant -->
                    <end_date>2015-01-13</end_date>                                     <!-- Service close date -->
                </service_object>
            </service>
        </contract>
    </customer>
</application>
</soapenv:Body>
</soapenv:Envelope>
